import json

import use_chatchat_13bglm3mini as ch2
import pandas as pd

# url = "http://192.168.11.33:7861/chat"
url = "http://192.168.11.201:7861/chat/chat"
# url2 = "http://192.168.11.33:7861/local_doc_qa/local_doc_chat"

headers = {"Content-Type": "application/json"}
data_all=[]

data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"无","人群标签":"失智","人际关系":"可","修饰":"完全依赖","喜好":"唱歌、跳舞","如厕":"需帮助","姓名":"徐克环","婚姻状况":"离婚","子女数量":"1","学历":"本科","宗教信仰":"无","家属关心程度":"不详","家属史":"女儿患阿尔兹海默氏病","家属期望":"降低家庭照护负担","心里创伤":"有2002年儿子去世、女儿患AD","性别":"女","教育年限":"0","既往史":"阿尔茨海默病（幻觉错觉），高血压，抑郁（儿子02年去世，女儿患AD），甲减，尿路感染，骨质疏松","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"偶尔沟通困难","洗澡":"完全依赖","照护难度系数":"一般","现病":"阿尔茨海默病、高血压、骨质疏松","生日":"1936-10-09","用餐":"其他","穿衣":"需帮助","管路":"不需要","精神行为标签":"异常运动行为、幻觉","约束状态":"无","纸尿裤":"晚上穿","药物服务配合度":"可配合","药物服用方式":"合在饭内","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者徐克环在卫生间如厕，其他认知症长者拉扶过程中坐倒在地，未造成伤害","萤火虫事件分类":"厕所内跌倒","萤火虫事件发生时间":"2023-10-08 06:02:00","萤火虫事件后果":"无异常","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"照护员要时刻关注到老人们的动向","萤火虫事件症状表现":"无症状","认知症类型":"阿尔茨海默病","进食方式":"自理","退休工资":"8000以上","配合程度":"安心","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"无","人群标签":"以上都不是","人际关系":"可","修饰":"需帮助","喜好":"唱歌、跳舞、看书报、其他看书（哲学）","如厕":"自理","姓名":"牟永生","婚姻状况":"未婚","子女数量":"0","宗教信仰":"无","客户来源":"医院转介上海市精神卫生中心","家属关心程度":"一般","家属期望":"降低家庭照护负担","心里创伤":"无","性别":"男","教育年限":"0","既往史":"双相情感障碍、糖尿病","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"否","民族":"汉族","沟通能力":"正常","洗澡":"自理","照护难度系数":"轻度","现病":"双相情感障碍、糖尿病","生日":"1957-01-14","用餐":"其他","穿衣":"自理","管路":"不需要","精神行为标签":"妄想","约束状态":"无","纸尿裤":"不需要","药物服务配合度":"可配合","药物服用方式":"独立服用","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"牟永生与洪鼎藩发生口角过程中，","萤火虫事件分类":"他伤自伤","萤火虫事件发生时间":"2023-10-08 08:00:00","萤火虫事件后果":"无异常","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"牟永生诊断为双相情感障碍，存在情绪易激惹倾向，照护员因及时分开二人避免言语争执","萤火虫事件症状表现":"其他损伤","进食方式":"自理","配合程度":"安心","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"人群标签":"失智","人际关系":"可","修饰":"完全依赖","喜好":"唱歌","如厕":"完全依赖","姓名":"包福明","婚姻状况":"已婚","子女数量":"1","学历":"大专","宗教信仰":"无","家属关心程度":"关心","家属期望":"降低家庭照护负担、延缓生活质量下降","忌口食物":"太油腻食物","性别":"男","手术史":"无","教育年限":"0","既往史":"阿尔茨海默病","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"沟通困难","洗澡":"完全依赖","照护难度系数":"重度","现病":"阿尔茨海默病","生日":"1950-12-06","用餐":"其他","穿衣":"完全依赖","管路":"不需要","精神行为标签":"易激惹/情绪不稳","约束状态":"无","纸尿裤":"晚上穿","药物服务配合度":"可配合","药物服用方式":"独立服用","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者晚间测量体温：38.3℃，加0.5℃，长者目前实际的体温：38.8℃，叮嘱照护员给与予物理降温，多喂水，布洛芬一粒，于21：44分联系上了长者家属，家属说明日过来送药，先观察，叮嘱照护员多关心，夜间多巡视。","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-01 20:12:00","萤火虫事件后果":"生命体征异常 强化观察要检查 ","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感传染","萤火虫事件症状表现":"发热","认知症类型":"阿尔滋海默病","进食方式":"喂饭","配合程度":"安心","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"无","人群标签":"以上都不是","修饰":"完全依赖","如厕":"完全依赖","姓名":"臧彩娣","婚姻状况":"丧偶","子女数量":"1","学历":"初中","宗教信仰":"无","家属关心程度":"关心","家属期望":"延缓生活质量下降","心里创伤":"无","性别":"女","教育年限":"0","既往史":"脑梗死","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"沟通困难","洗澡":"完全依赖","照护难度系数":"中","生日":"1940-01-20","穿衣":"完全依赖","约束状态":"白天约束","纸尿裤":"全天穿","药物服务配合度":"可配合","药物服用方式":"独立服用","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者于今天早上09:34分测体温:37.2°，加0.5°，长者实际体温：37.7°，给与长者物理降温，长者目前情况通知家属，家属说马上赶过来，10：50分快递强力枇杷露，克感敏，布洛芬，嘱按说明书上服用，13：08分复测体温37.7°加0.5°，长者实际体温38.2°，照护员喂克感敏1粒，嘱照护员给长者多喂水。","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-02 09:34:00","萤火虫事件后果":"生命体征异常 强化观察要检查 ","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感传染","萤火虫事件症状表现":"发热","行动能力":"轮椅","进食方式":"喂饭","配合程度":"试探","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"人群标签":"失智","人际关系":"一般","修饰":"完全依赖","喜好":"唱歌、其他听歌","如厕":"完全依赖","姓名":"徐益珠","婚姻状况":"离婚","子女数量":"0","学历":"初中","宗教信仰":"无","客户来源":"医院转介","家属关心程度":"一般","家属期望":"降低家庭照护负担","性别":"女","教育年限":"0","既往史":"阿尔兹海默病性痴呆（老年前期型）","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"沟通困难","洗澡":"完全依赖","照护难度系数":"中","现病":"阿尔兹海默病性痴呆（老年前期型）","生日":"1956-11-11","用餐":"其他","穿衣":"完全依赖","管路":"不需要","精神行为标签":"情感淡漠/漠不关心","约束状态":"无","纸尿裤":"全天穿","药物服务配合度":"可配合","药物服用方式":"鼻饲","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者于今天下午13：41分测量体温：37.7°加0.5，长者实际体温38.2°，嘱照护员喂莲花清瘟颗粒一包，给予物理降温，长者的情况已通知家属，家属表示不外出就医，于下午15：00快递来布洛芬胶囊，及甲流测试纸，布洛芬嘱按说明书上给长者服喂，多喂水。分别测了甲流和抗原，测得结果正常。如下图：","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-02 13:41:01","萤火虫事件后果":"生命体征异常 强化观察要检查 ","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感传染","萤火虫事件症状表现":"发热","行动能力":"轮椅","认知症类型":"阿尔兹海默病性痴呆（老年前期型）","进食方式":"鼻饲","配合程度":"安心","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"无","人际关系":"可","修饰":"完全依赖","健康史":"感染史","喜好":"唱歌、跳舞","如厕":"需帮助","姓名":"徐乃仁","婚姻状况":"已婚","子女数量":"1","宗教信仰":"无","客户来源":"医院转介精卫","家属关心程度":"关心","家属期望":"延缓生活质量下降、延缓失能失智等级提升、降低家庭照护负担","性别":"男","教育年限":"0","既往史":"阿尔滋海默病性痴呆（老年型）； 冠状动脉硬化性心脏病； 腔隙性脑梗死； 房性期前收缩（房性早搏）； 室性期前收缩； 胆囊切除术后状态","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"正常","洗澡":"完全依赖","照护难度系数":"中度","生日":"1943-07-07","用餐":"糖尿病","穿衣":"需帮助","约束状态":"无","纸尿裤":"不需要","药物服用方式":"合在饭内","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者于中午测量体温37.8°，加0.5°长者目前体温：38.3给予物理降温，家属今天来看长者，没有进机构，在门口，家属对我们表示不满，说万里机构甲流横行，没人通知他，家属买了测甲流测试，测试如下图，下午13：50分复测体温：38.2。","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-02 12:06:00","萤火虫事件后果":"生命体征异常 强化观察要检查 ","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感传染","萤火虫事件症状表现":"发热","认知症类型":"阿尔滋海默病性痴呆（老年型）","进食方式":"喂饭","配合程度":"试探","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"无","人群标签":"以上都不是","人际关系":"可","修饰":"完全依赖","喜好":"唱歌","如厕":"完全依赖","姓名":"赵志宏","婚姻状况":"丧偶","子女数量":"2","学历":"本科","宗教信仰":"无","客户来源":"医院转介精卫","家属关心程度":"关心","家属期望":"延缓失能失智等级提升","心里创伤":"无","性别":"女","手术史":"无","教育年限":"0","既往史":"阿尔茨海默病性痴呆（重度）； 阿尔茨海默病性痴呆（老年型）; 高血压； 尺骨远端骨折伴桡骨远端骨折； 腰椎压缩性骨折","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"否","民族":"汉族","沟通能力":"偶尔沟通困难","洗澡":"完全依赖","照护难度系数":"重度","现病":"阿尔茨海默病性痴呆（重度）、高血压","生日":"1941-12-26","用餐":"其他","穿衣":"完全依赖","精神行为标签":"激越/攻击、抑郁/心境恶劣、脱抑制、易激惹/情绪不稳","约束状态":"无","纸尿裤":"晚上穿","药物服用方式":"独立服用","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"长者于今天早上9：00测量体温：38°加0.5°，长者目前体温38.5°，嘱照顾员喂长者的备药，酚麻美敏片1粒口服，降温物理。长者目前情况已通知其家属。家属表示配药送来。","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-01 09:00:00","萤火虫事件后果":"生命体征异常 强化观察要检查 ","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感传染。","萤火虫事件症状表现":"发热","行动能力":"轮椅","认知症类型":"阿尔茨海默病性痴呆（重度）","进食方式":"自理","配合程度":"试探","重点观察老人":"是"}'''
data_all.append(data)
data='''根据下面的文本，生成不超过5个关键词来提示老人存在的健康风险。只返回关键词，不要加入其他内容。老人的情况是：{"义齿":"有","人群标签":"失智","人际关系":"一般","修饰":"完全依赖","健康史":"感染史","喜好":"唱歌","如厕":"完全依赖","姓名":"孙琳珍","婚姻状况":"丧偶","子女数量":"2","学历":"本科","宗教信仰":"无","家属关心程度":"一般","家属期望":"降低家庭照护负担","性别":"女","教育年限":"0","既往史":"1.双下肢深静脉血栓； 2.肺部感染； 3.高血压病； 4.2型糖尿病； 5.冠状动脉粥样硬化性心脏病； 6.阿尔兹海默病","是否有精神行为表现":"否","是否离退休干部":"否","是否离退休老人":"是","民族":"汉族","沟通能力":"偶尔沟通困难","洗澡":"完全依赖","照护难度系数":"重度","现病":"1.双下肢深静脉血栓； 2.肺部感染； 3.高血压病； 4.2型糖尿病； 5.冠状动脉粥样硬化性心脏病； 6.阿尔兹海默病","生日":"1935-12-16","用餐":"其他","穿衣":"完全依赖","管路":"不需要","精神行为标签":"睡眠/夜间行为","约束状态":"无","纸尿裤":"全天穿","药物服务配合度":"可配合","药物服用方式":"合在饭内","萤火虫事件事件发生状态":"集体服务","萤火虫事件事件描述":"今日早上给长者测量生命体征，水银测量体温37.5°，加0.5°长者实际体温38.0°给予物理降温，联系了家属不送外出就诊 ，外面买药送到机构，按药说明书上服用。","萤火虫事件分类":"隔离","萤火虫事件发生时间":"2023-10-02 08:27:00","萤火虫事件后果":"中度伤害需住院治疗","萤火虫事件就医情况":"未就医","萤火虫事件根因分析":"流感","萤火虫事件症状表现":"发热","行动能力":"轮椅","认知症类型":"阿尔兹海默病","进食方式":"喂饭","配合程度":"安心","重点观察老人":"是"}'''
data_all.append(data)
# txt='''人名王平，呃老人王平该老人入住机构，第二天早上由照护员提醒自行起来洗漱完成晨间护理6:30，测量生命体征36度3，嗯优秀学生嗯脉搏脉搏70次，每分钟血氧95%，血压127 69，精神状态好，三餐都经呃集体活动全程参与，白天饮水1800毫升，排尿6次，量正常，色淡黄，大便一次成型量正常，其他无异常，精神状态良好，食欲正常，能够自己正常上卫生间喜欢看电视，防跌倒晚班，继续观察老人情况，照护过程仍需防走失、防误时、防坠床、防跌倒照护时，仍需向照护者，仍需向长者介绍本机构的环境，卫生间、沐浴间及房间等多空间的设施设备特别比较近。'''
# data=f'''给定一段文本：{txt}。
#     根据提供的文本：第1步，输出老人的姓名；
#     第2步，根据提供的文本格式化地输出老人的健康体征，健康体征可包括[体温，血氧饱和度，脉搏，血压，血糖，饮食，大便，小便，睡眠情况，身高，体重，小腿围，大腿围，外出情况，返院情况，皮肤，精神状况，其他情况],没有提及的字段不必输出。
#     第3步，根据第2步的健康体征，罗列出异常的情况。
#     第4步：根据第3步得到的异常情况给出照护或处理意见。
#     '''
# data_all.append(data)
# txt='''孙红英嘛孙红英就这一段有点不太正常，吃饭不喝口罩，扔得满桌就是吃不了的，说放到地下脚踩一踩，给你遍地都是扔的，遍地都是碗，昨天晚上把碗也摔破了，桌子也拉开了，水倒的满桌都是我们晚上我们晚上去茶叶，他们说我们去偷他东西了，最少去4次。那你念一下他的这个体温，孙红英最后用体温36度3，缺氧98，脉搏86，上压113，低压71，他的血压是平稳的。他就是这段精神状况。姑娘来了估计受刺激了，不太好，她女儿不来，她还好，她女儿一来一个礼拜都下不去，把我们搞得我们也真的特疲惫，唉呀我们也疲惫，他今天还错了，马上就告诉姑娘，他们姑娘个都可以，那么多都在里面，噢不行去吧，看谁要去了。'''
# data=f'''给定一段文本：{txt}。
#     根据提供的文本：第1步，输出老人的姓名；
#     第2步，根据提供的文本格式化地输出老人的健康体征，健康体征可包括[体温，血氧饱和度，脉搏，血压，血糖，饮食，大便，小便，睡眠情况，身高，体重，小腿围，大腿围，外出情况，返院情况，皮肤，精神状况，其他情况],没有提及的字段不必输出。
#     第3步，根据第2步的健康体征，罗列出异常的情况。
#     第4步：根据第3步得到的异常情况给出照护或处理意见。
#     '''
# data_all.append(data)
# txt='''新月芳老人入住机构第三天基本融入集体生活，早上自行起床洗漱，6:30测量生命体征，体温36度3，脉搏62次，每分杨宝98，血压137 71，三餐饮食一般可独立进食，其他无异常能跟其他老人正常沟通，已经慢慢熟悉机构环境，还需防老人跌倒晚班，需要继续观察老人情况，夜班照护员离床报警响后需要及时响应，白班需多向长者介绍环境，提高长者的定位能力。'''
# data=f'''给定一段文本：{txt}。
#     根据提供的文本：第1步，输出老人的姓名；
#     第2步，根据提供的文本格式化地输出老人的健康体征，健康体征可包括[体温，血氧饱和度，脉搏，血压，血糖，饮食，大便，小便，睡眠情况，身高，体重，小腿围，大腿围，外出情况，返院情况，皮肤，精神状况，其他情况],没有提及的字段不必输出。
#     第3步，根据第2步的健康体征，罗列出异常的情况。
#     第4步：根据第3步得到的异常情况给出照护或处理意见。
#     '''
# data_all.append(data)
# txt='''徐艺珠老人入住机构，第二天早早上由照护员提醒自行起来洗漱完成，晨间护理6:30测量生命体征，体温36.3度，呃血这个什么心率70次，每分氧分压百95%，脉搏高压127，呃低压69毫米汞柱，精神状态好。白天胃管注水1200毫升，排尿6次，量颜色正常啊颜色正常，大便一次成型量正常，其他无异常，精神状态良好。照护时人向长者介绍本机构的环境卫生间、沐浴间及房间等多空间设施设备，特别是卫生间等区，重点反复介绍加强长者记忆，鼓励长者多参加机构活动，尽早适应环境。'''
# data=f'''给定一段文本：{txt}。
#     根据提供的文本：第1步，输出老人的姓名；
#     第2步，根据提供的文本格式化地输出老人的健康体征，健康体征可包括[体温，血氧饱和度，脉搏，血压，血糖，饮食，大便，小便，睡眠情况，身高，体重，小腿围，大腿围，外出情况，返院情况，皮肤，精神状况，其他情况],没有提及的字段不必输出。
#     第3步，根据第2步的健康体征，罗列出异常的情况。
#     第4步：根据第3步得到的异常情况给出照护或处理意见。
#     '''
# data_all.append(data)
# txt='''严云慧老人嗯今天6:30测量了生命体征，嗯然后体温是36度3，嗯心率是62，然后氧饱和是98%。嗯噢行了，晚班是需要继续观察老人的情况，夜班照护员离场警报后需要及时的响应，白班需要向长者介绍环境，然后提高长者的一个定位能力和长者的生命体征的一个平稳，嗯他今天的情绪状态尚好，嗯然后对问答的回答还有活动参与度好，嗯招呼过程中仍需要防走失防污务实，还有房间倒还有房地产。'''
# data=f'''给定一段文本：{txt}。
#     根据提供的文本：第1步，输出老人的姓名；
#     第2步，根据提供的文本格式化地输出老人的健康体征，健康体征可包括[体温，血氧饱和度，脉搏，血压，血糖，饮食，大便，小便，睡眠情况，身高，体重，小腿围，大腿围，外出情况，返院情况，皮肤，精神状况，其他情况],没有提及的字段不必输出。
#     第3步，根据第2步的健康体征，罗列出异常的情况。
#     第4步：根据第3步得到的异常情况给出照护或处理意见。
#     '''
# data_all.append(data)
# data='''老人长期服用药品奥氮平，可能导致哪些健康风险？'''
# data_all.append(data)
# data='''老人长期服用药品奥氮平，该药物是否会导致以下风险？如恶心、头晕、乏力、呕吐、食欲异常、睡眠异常、头疼、血压异常、情绪异常、心率异常、血糖异常、大便异常、体温异常'''
# data_all.append(data)
# data='''老人长期服用药品阿立哌唑，可能导致哪些健康风险？'''
# data_all.append(data)
# data='''老人长期服用药品阿立哌唑，该药物是否会导致以下风险？如恶心、头晕、乏力、呕吐、食欲异常、睡眠异常、头疼、血压异常、情绪异常、心率异常、血糖异常、大便异常、体温异常'''
# data_all.append(data)
# data='''老人长期服用药品舍曲林，可能导致哪些健康风险？'''
# data_all.append(data)
# data='''老人长期服用药品舍曲林，该药物是否会导致以下风险？如恶心、头晕、乏力、呕吐、食欲异常、睡眠异常、头疼、血压异常、情绪异常、心率异常、血糖异常、大便异常、体温异常'''
# data_all.append(data)
# data='''老人长期服用药品丙戊酸镁，可能导致哪些健康风险？'''
# data_all.append(data)
# data='''老人长期服用药品丙戊酸镁，该药物是否会导致以下风险？如恶心、头晕、乏力、呕吐、食欲异常、睡眠异常、头疼、血压异常、情绪异常、心率异常、血糖异常、大便异常、体温异常'''
# data_all.append(data)
# data='''老人长期服用药品尼莫地平，可能导致哪些健康风险？'''
# data_all.append(data)
# data='''老人长期服用药品尼莫地平，该药物是否会导致以下风险？如恶心、头晕、乏力、呕吐、食欲异常、睡眠异常、头疼、血压异常、情绪异常、心率异常、血糖异常、大便异常、体温异常'''
#结果res
#data_all.append(data)

res=pd.DataFrame()

question_list=[]  #保存问题
answer_list=[]    #保存答案

#chatglm3-6b baichuan-13b-chat
model_name=["baichuan-13b-chat","chatglm3-6b","chatglm2-6b"][2]
def test_all_llm():

  for i in data_all:
    #print(i['question'])
    data = {"query": i,"history": [],"stream": 0,"model_name": model_name,"temperature": 0.2,"max_tokens": 600,"prompt_name": "default"}#chatglm3-6b baichuan-13b-chat
    question_list.append(i)
    responses=ch2.chat(url=url, headers=headers, data=data)
    print(responses)
    # 1/0
    answer_list.append(responses)
  res["问题"]=pd.Series(question_list)
  res["回答_"+model_name]=pd.Series(answer_list)
  res.to_csv('/srv/问答结果比较/问答结果_'+model_name+'_风险标签.csv', index=False, encoding='utf-8-sig')


if __name__ == "__main__":
  test_all_llm()
  #notuselora()
  print("success")
